theholypumpkin/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# Seeed Femto M0 (SAMD21)
# ------------------------------
Seeed_femto_m0.name=Seeed Femto M0
Seeed_femto_m0.vid.0=0x2886
Seeed_femto_m0.pid.0=0x802C
Seeed_femto_m0.vid.1=0x2886
Seeed_femto_m0.pid.1=0x002C
Seeed_femto_m0.upload.tool=bossac
Seeed_femto_m0.upload.protocol=sam-ba
Seeed_femto_m0.upload.maximum_size=262144
Seeed_femto_m0.upload.offset=0x2000
Seeed_femto_m0.upload.use_1200bps_touch=true
Seeed_femto_m0.upload.wait_for_upload_port=true
Seeed_femto_m0.upload.native_usb=true
Seeed_femto_m0.build.mcu=cortex-m0plus
Seeed_femto_m0.build.f_cpu=48000000L
Seeed_femto_m0.build.usb_product="Seeed femto M0"
Seeed_femto_m0.build.usb_manufacturer="Seeed"
Seeed_femto_m0.build.board=SAMD_FEMTO_M0
Seeed_femto_m0.build.core=arduino
Seeed_femto_m0.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DSEEED_FEMTO_M0 {build.usb_flags}
Seeed_femto_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Seeed_femto_m0.build.openocdscript=openocd_scripts/femto_m0.cfg
Seeed_femto_m0.build.variant=femto_m0
Seeed_femto_m0.build.variant_system_lib=
Seeed_femto_m0.build.vid=0x2886
Seeed_femto_m0.build.pid=0x802C
Seeed_femto_m0.bootloader.tool=openocd
Seeed_femto_m0.bootloader.file=circuitplayM0/bootloader-femto_m0-v3.7.0-31-seeeduino.bin
Seeed_femto_m0.menu.usbstack.arduino=Arduino
Seeed_femto_m0.menu.usbstack.tinyusb=TinyUSB
Seeed_femto_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
Seeed_femto_m0.menu.debug.off=Off
Seeed_femto_m0.menu.debug.on=On
Seeed_femto_m0.menu.debug.on.build.flags.debug=-g

# Seeed Grove UI Wireless (SAMD51)
# ------------------------------
seeed_grove_ui_wireless.name=Seeed Grove UI Wireles (SAMD51)
seeed_grove_ui_wireless.vid.0=0x2886
seeed_grove_ui_wireless.pid.0=0x802D
seeed_grove_ui_wireless.vid.1=0x2886
seeed_grove_ui_wireless.pid.1=0x802D
seeed_grove_ui_wireless.upload.tool=bossac18
seeed_grove_ui_wireless.upload.protocol=sam-ba
seeed_grove_ui_wireless.upload.maximum_size=507904
seeed_grove_ui_wireless.upload.offset=0x4000
seeed_grove_ui_wireless.upload.use_1200bps_touch=true
seeed_grove_ui_wireless.upload.wait_for_upload_port=true
seeed_grove_ui_wireless.upload.native_usb=true
seeed_grove_ui_wireless.build.mcu=cortex-m4
#seeed_grove_ui_wireless.build.f_cpu=120000000L
seeed_grove_ui_wireless.build.usb_product="Seeed Grove UI Wireles"
seeed_grove_ui_wireless.build.usb_manufacturer="Seeed Studio"
seeed_grove_ui_wireless.build.board=GROVE_UI_WIRELESS
seeed_grove_ui_wireless.build.core=arduino
seeed_grove_ui_wireless.build.extra_flags=-D__SAMD51P19A__ -DSEEED_GROVE_UI_WIRELESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
seeed_grove_ui_wireless.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
seeed_grove_ui_wireless.build.openocdscript=openocd_scripts/arduino_zero.cfg
seeed_grove_ui_wireless.build.variant=grove_ui_wireless
seeed_grove_ui_wireless.build.variant_system_lib=
seeed_grove_ui_wireless.build.vid=0x2886
seeed_grove_ui_wireless.build.pid=0x802D
seeed_grove_ui_wireless.bootloader.tool=openocd
seeed_grove_ui_wireless.bootloader.file=groveUIWireless/bootloader-groveUIWireless_m4-v3.7.0-Seeed.bin
seeed_grove_ui_wireless.compiler.arm.cmsis.ldflags="-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
seeed_grove_ui_wireless.menu.cache.on=Enabled
seeed_grove_ui_wireless.menu.cache.on.build.cache_flags=-DENABLE_CACHE
seeed_grove_ui_wireless.menu.cache.off=Disabled
seeed_grove_ui_wireless.menu.cache.off.build.cache_flags=
seeed_grove_ui_wireless.menu.speed.120=120 MHz (standard)
seeed_grove_ui_wireless.menu.speed.120.build.f_cpu=120000000L
seeed_grove_ui_wireless.menu.speed.150=150 MHz (overclock)
seeed_grove_ui_wireless.menu.speed.150.build.f_cpu=150000000L
seeed_grove_ui_wireless.menu.speed.180=180 MHz (overclock)
seeed_grove_ui_wireless.menu.speed.180.build.f_cpu=180000000L
seeed_grove_ui_wireless.menu.speed.200=200 MHz (overclock)
seeed_grove_ui_wireless.menu.speed.200.build.f_cpu=200000000L
seeed_grove_ui_wireless.menu.opt.small=Small (-Os) (standard)
seeed_grove_ui_wireless.menu.opt.small.build.flags.optimize=-Os
seeed_grove_ui_wireless.menu.opt.fast=Fast (-O2)
seeed_grove_ui_wireless.menu.opt.fast.build.flags.optimize=-O2
seeed_grove_ui_wireless.menu.opt.faster=Faster (-O3)
seeed_grove_ui_wireless.menu.opt.faster.build.flags.optimize=-O3
seeed_grove_ui_wireless.menu.opt.fastest=Fastest (-Ofast)
seeed_grove_ui_wireless.menu.opt.fastest.build.flags.optimize=-Ofast
seeed_grove_ui_wireless.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
seeed_grove_ui_wireless.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
seeed_grove_ui_wireless.menu.maxqspi.50=50 MHz (standard)
seeed_grove_ui_wireless.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
seeed_grove_ui_wireless.menu.maxqspi.fcpu=CPU Speed / 2
seeed_grove_ui_wireless.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
seeed_grove_ui_wireless.menu.usbstack.arduino=Arduino
seeed_grove_ui_wireless.menu.usbstack.tinyusb=TinyUSB
seeed_grove_ui_wireless.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
seeed_grove_ui_wireless.menu.debug.off=Off
seeed_grove_ui_wireless.menu.debug.on=On
seeed_grove_ui_wireless.menu.debug.on.build.flags.debug=-g


